# 存储目录主结构：
# /report/年/月/日/tjbh/
# 图片位置：/report/2018/2018-09/2018-09-01/166820124/image/...
# html位置：/report/2018/2018-09/2018-09-01/166820124/166820124.html
# pdf位置：/report/2018/2018-09/2018-09-01/166820124/166820124.pdf
# 166820124.html,166820124.pdf 后缀采用加密方式

# 正向步骤：
# 一、调用API
# 1、客户端审核完成调用 API服务；传递参数：tjbh 默认参数html
# 2、API服务传递 消息 给服务进程 队列
# 二、生成HTML
# 3、获取彩超、内镜、心电图、骨密度、人体成分等图片到指定目录下
# 4、如果缺少某类图片，写入数据库中
# 5、生成html
# 三、生成PDF
# 6、客户端审阅完成调用 API服务：传递参数：tjbh 默认参数pdf
# 7、生成PDF

# 反向步骤：
# 一、取消审阅
# 1、客户端取消审阅调用 API服务：传递参数：tjbh 默认参数pdf


def run(queue=None):
    pass
